// - /** */ коментар на нов ред
// let = променлива
// "%" - дадено число / 100
// Math.trunc() цяло число
// 20/100 > 0.20 от = *
// по-малък % от нещо = 100% - 40% = 60% = 0.6 от > * нещо

// let a = Number("5") > парсинг > ще сменим типа > от текст към число
// boolian стойности (true & false)
// оператор за сравнение (еднаквост по стойност) == (5 = "5" true)
// оператор за еднаквост по тип и стойност === (5 = "5" false)
// !==(тип и стойност) оператор за отрицание 
// !==(стойност)

// num %(модулно делено) 2 === 0

// Math.ceil = по-близко цяло число нагоре
// Math.floor = закръгля по-близко цяло число надолу
// Math.abs = връща абсол/тна стойност на число 
// Math.trunc = цяло число
// Math.pow = число на степен (10, 2) = 100 , (2, 2) = 4
// Math.round = закръгля 

// toFixed = форматира(закръгля) число след десеттичната запетая
// toFixed = закръгля с една единица нагоре
// toFixed = преобразува число в стринг

// += добави към и запази резултата
// 4 % 2 === 0 > четно и нечетно % модулно делене
// % 10 === 5 > числото завършва на 5