// - /** */ коментар на нов ред
// let = променлива
// "%" - дадено число / 100
// Math.trunc() цяло число
// 20/100 > 0.20 от = *
// по-малък % от нещо = 100% - 40% = 60% = 0.6 от > * нещо

// let a = Number("5") > парсинг > ще сменим типа > от текст към число
// boolian стойности (true & false)
// оператор за сравнение (еднаквост по стойност) == (5 = "5" true)
// оператор за еднаквост по тип и стойност === (5 = "5" false)
// !==(тип и стойност) оператор за отрицание 
// !==(стойност)

// num %(модулно делено) 2 === 0

// Math.ceil = по-близко цяло число нагоре
// Math.floor = закръгля по-близко цяло число надолу
// Math.abs = връща абсол/тна стойност на число 
// Math.trunc = цяло число
// Math.pow = число на степен (10, 2) = 100 , (2, 2) = 4
// Math.round = закръгля 

// toFixed = форматира(закръгля) число след десеттичната запетая
// toFixed = закръгля с една единица нагоре
// toFixed = преобразува число в стринг

// += добави към и запази резултата
// 4 % 2 === 0 > четно и нечетно % модулно делене
// % 10 === 5 > числото завършва на 5

// 123456 % 100 > 56 > % 1000 > 456 = една 0 = 1цифра

// ? even : odd = тернарен оператор > вярно или грешно

// инкрементиране(за число)  = увеличава с една единица: 
// "++a" > a = a+1 > променя и след това отпечатва
// "a++" > = отпечатва и след това променя
// декраментация = намалява с една единица:
// --a > променя стойноста с една единица и след това отпечатва
// a-- > извършва действието и след това останалите действия

// a = a + 1 или a += 1;
// условието приеме ли false приключва

// цикъла е броене на повторения
// i - инкрементация
// for (let i = 1; i <= 12; i = i += 1) или (i = 1; i <= 12; i = i++)
//     console.log(i);

// първо от ляво на дясно и след това повторения от дясно на ляво
// i - създаване на променлива(проверява)
// i <= 12 проверява докато е равна или по-малка от 12
// i + 1 = променя дали

// масив = структура - в една променлива много стойности
// let arr = [10, 11, 12]
// console.table(arr); - презентира в таблица
// console.log(arr.length);
// console.log(arr[0]);

// tekst.length = символи в текст = колко цифри има в думата
// let text = name
// text[0] = взема първата буква
// text[1] = взема втората буква от променливата
// или text.charAt(4) = взема 5тата

// shift + alt + надолу - copy цял ред
// ctrl + shift + L - заменям променлива навсякъде в кода

// let i = 1
// while(i <= 10) { if (true) { break; } console.log(i); i++ }

// let text = input[index];
// index++; един след друг

// Number.MAX_SAFE_INTEGER най-голямото положително
// Number.MIN_SAFE_INTEGER  най-малкото отрицателно

// continue = прекъсва текущата интерация и продължава към следващия цикъл