function trainingLab(w, h) {

    let trainingLab = w * h;
    let corridor = trainingLab - 100;
    let desk = 70;
    let hall = 1500;
    let places = 12 * 120;
    let allPlaces = places * desk - 3;
    let department = desk - 3;


}

trainingLab(15, 8.9);

// Залата е широка 890 cm. От тях 100 cm отиват за коридора в средата. 
// В останалите 790 cm могат да се разположат по 11 бюра на ред (11 * 70 cm = 770 cm + 20 cm остатък).
// Залата е дълга 1500 cm. В тях могат да бъдат разположени 12 реда (12 * 120 cm = 1440 + 60 cm остатък).
// Брой места = 12 * 11 - 3 =  132 - 3 = 129 
// (имаме 12 реда по 11 места = 132 минус 3 места за катедра и входна врата).

// Учебна зала има правоъгълен размер w на h метра, без колони във вътрешността си. 
// Залата е разделена на две части – лява и дясна, с коридор приблизително по средата. 
// В лявата и в дясната част има редици с бюра. 
// В задната част на залата има голяма входна врата. 
// В предната част на залата има катедра с подиум за преподавателя. 
// Едно работно място заема 70 на 120 cm (маса с размер 70 на 40 cm + място за стол 
//     и преминаване с размер 70 на 80 cm). Коридорът е широк поне 100 cm. 
//     Изчислено е, че заради входната врата (която е с отвор 160 cm) 
//     се губи точно 1 работно място, а заради катедрата (която е с размер 160 на 120 cm) 
//     се губят точно 2 работни места. Напишете програма, 
//     която въвежда размери на учебната зала и изчислява броя работни места в нея 
//     при описаното разположение (вж. фигурата).