function logistics(input) {

    let transportedLoads = Number(input[0]);

    let cargos = "";
    let price = 0;

    for (let i = 1; i <= transportedLoads; i++) {
        let cargos = input[i];

        if (cargos === "Bus") {
            priceForTon += 200;
            
        } else if (cargos === "Truck") {
            priceForTon += 175;
            
        } else if (cargos === "Train") {
            priceForTon += 120
       
        }
    }

    priceWithBus = (transportedLoads / cargos) * 100;
    priceWithTruck = (transportedLoads / cargos) * 100;
    priceWithTrain = (transportedLoads / cargos) * 100;

    console.log(priceWithBus);

}

logistics(["4", "1", "5", "16", "3"]);
logistics(["5", "2", "10", "20", "1", "7"]);

// Всички товари 1 + 5 + 16 + 3 = 25 тона
// (4 * 200 + 5 * 175 + 16 * 120)/25 = 143.80 (средно на тон)
// С микробус – 4/25*100 = 16.00%
// С камион – 5/25*100 = 20.00%
// С влак – 16/25*100 = 64.00%

// Отговаряте за логистиката на различни товари. В зависимост от теглото на товара е нужно различно превозно средство. 
// Цената на тон, за която се превозва товара е различна за всяко превозно средство:
//     • До 3 тона – микробус (200 лева на тон)
//     • От 4 до 11 тона – камион (175 лева на тон)
//     • 12 и повече тона – влак (120 лева на тон)
// Вашата задача е да изчислите средната цена на тон превозен товар, както и процента на тоновете  
// превозвани с всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.

// От конзолата се четат поредица от числа, всяко на отделен ред:
//     • На първия ред – броя на товарите за превоз – цяло число в интервала [1...1000]
//     • За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала [1...1000]

//     Да се отпечатат на конзолата 4 реда, както следва:
//     • Първи ред – средната цена на тон превозен товар (закръглена до втория знак след дес. запетая);
//     • Втори ред – процентът тона превозвани с микробус (процент между 0.00% и 100.00%);
//     • Трети ред – процентът  тона превозвани с камион (процент между 0.00% и 100.00%);
//     Четвърти ред – процентът тона превозвани с влак (процент между 0.00% и 100.00%).